[["ProCan", 1, ["Protein", "Cell Line", "Drug"], ["Drug-Protein Association", "Cell Line-Protein Association", "Drug-Cell Line Association"], 1, "# Introduction \nProCan is the name for a set of data from the [Pan-cancer proteomic map of 949 human cell lines](https://pubmed.ncbi.nlm.nih.gov/35839778/) study by Gon&ccedil;alves et al.\n In this study, a pan-cancer proteomic map of 949 human cancer cell lines from over 40 cancer types was created to aid in the discovery of cancer biomarkers and targets for the development of new cancer treatments.\nThe predictive power of proteomics and transcriptomics (the study of all RNA molecules expressed in a unit) was found to be comparable and there is evidence that proteomics can provide additional important information not covered by transcriptomics.\nThe analysis yielded a dataset of approximately 8,500 proteins quantified in all cell lines.\n Part of this study also involved applying 625 drugs to the cell lines and recording the drug response data. \nFrom this, drug response data across cell lines in relation to their proteomic data could also be derived.\n Overall, this resulted in a comprehensive and complex dataset that enables proteins to be identified as cancer biomarkers and provides new targets for the development of new cancer treatments. \n # Structure of data \n | Field | Description |\n|---|---|\n| Cell_Line | The name of the cell line |\n| SIDM (Sanger IDentifier Model) | A core identifier used by Sanger in the Cell Model Passport, representing a sample |\n| Project_Identifier | SIDM + Cell_Line |\n| Tissue_type | The type of tissue from which this cell line originates |\n| Cancer_type | The general type of cancer associated with this cell line |\n| Cancer_subtype | A more specific subtype or subtype of the cancer |\n\n Source: [ProCan-DepMapSanger_mapping_file_averaged.txt](https://www.dropbox.com/sh/0nemsahltwwstjp/AADb9f6b99K4z2XUPwsJf96Qa?e=1&dl=0)\n\n| Field | Description |\n|---|---|\n| Entry | Unique and stable identifier of the entry. |\n| Entry name | The UniProtKB/Swiss-Prot entry name provides a mnemonic identifier for a UniProtKB entry, which is not a stable identifier. Each verified (reviewed) entry is assigned a unique entry name upon integration into UniProtKB/Swiss-Prot. |\n| Status | Determines whether a unique entry name is assigned to an entry in UniProtKB |\n| Length | The number of amino acid residues contained in a protein sequence |\n| Mass | Molecular mass of a protein, measured in Daltons |\n| Gene names (primary) | Names of one or more genes for the protein |\n\n Source: [uniprot_human_idmap.tab](https://www.dropbox.com/sh/0nemsahltwwstjp/AADb9f6b99K4z2XUPwsJf96Qa?e=1&dl=0)\n\n| Field | Description |\n|---|---|\n| drug_id/y_Id | Consists of drug_code, drug_name, and GDSC_version> |\n| x_id | Gene name of the protein |\n| n | Number of cell lines considered |\n| beta | Coefficient from linear models that include all covariates |\n| lr | Likelihood ratio |\n| covs | Covariates |\n| pval | p-value from the log-likelihood ratio test |\n| fdr | BH-adjusted p-value |\n| nc_beta | Coefficient from linear models that do not use transcriptomic covariate |\n| nc_lr | Likelihood ratio that does not include transcriptomic covariates |\n| nc_pval | p-value from linear models that do not include transcriptomic covariates |\n| nc_fdr | FDR from linear models that do not include transcriptomic covariates |\n| r2 | Pearson's r between the actual IC50 and the predicted IC50 from DeepOmicNet |\n| target | Designated target of the drug from curated information by Sanger |\n| ppi | Distance between the protein and the drug target in the protein-protein interaction network |\n| skew | Skewness of the distribution of a drug's IC50. The smaller this is, the more selective a drug is |\n\n Source: [lm_sklearn_degr_drug_annotated_diann_051021](https://www.dropbox.com/sh/0nemsahltwwstjp/AADb9f6b99K4z2XUPwsJf96Qa?e=1&dl=0)\n\n| Field | Description |\n|---|---|\n| drug_id | A drug can have one or more drug_id's, as the drug may be studied in different locations |\n| drug_name | Drug name |\n| drug_owner | Owner of the drug |\n| webrelease | |\n| PUBCHEM | A unique identifier assigned to a chemical compound entry in the PubChem database |\n| target_pathway | Biological pathway or process that the drug targets or interacts with to exert its effect |\n| putative_gene_target | Putative gene target of the drug |\n| model_treatment | |\n| drug_synonyms | Drug synonyms |\n| putative_target | Putative target |\n| CHEMBL | Unique identifier used in the ChEMBL database |\n| dataset | Indicates whether it is part of the GDSC1 or GDSC2 data set|\n| RMSE | Root Mean Square Error (root of the mean of the squared deviations between observed and predicted values)|\n| num_replicates | Number of repetitions|\n| AUC | Area Under the Curve|\n| max_screening_conc | Maximum screening concentration|\n| ln_IC50 | Natural logarithm of half the maximum inhibitory concentration|\n| COSMIC_ID | Identifier for COSMIC|\n| cancer_type_detail | The most detailed description of the tumor available in the passport using the NCI Thesaurus Terms|\n| model_type ||\n| BROAD_ID | Identifier for Broad (CCLE)|\n| model_synonyms | Synonyms for models|\n| sample_treatment_details | The treatment details contain specific information about the medication or the treatment carried out|\n| master_cell_id | Master cell id|\n| cancer_type | A broad disease classification that describes the specimen tumor. The cancer type also highlights specimens obtained from non-cancerous tissue. All cancer types are NCIT terms.|\n| model_treatment | Model treatments take place during or after model production|\n| sample_treatment |  The treatment of the sample refers to all therapies received by the patient prior to sampling and was broadly categorized into groups such as chemotherapy and radiotherapy|\n| model_name | The name of the model as used in the Sanger Dependency Map. If applicable, synonyms are also given|\n| RRID | Identifier for Cellosaurus (RRID)|\n| growth_properties | The models were divided into three categories: Adherent, Semi-Adherent and Suspension|\n| tissue | Describes the location of the tumor from which the sample was taken. If a model was obtained from metastatic tissue, the location of the primary tumor is indicated|\n| msi_status | Indicates the microsatellite instability status of a cell model|\n| use_in_publications | Indication of whether the cell model has been published in a publication|\n| model_id | A core identifier used by Sanger in the (Cell Model) Passport|\n| sample_site | The site in the body or tissue from which the sample was taken|\n| cell_line_name | Name of the cell line|\n\nSource: [DrugResponse_ProCanCER_GDSC1_GDSC2_20200602.csv](https://www.dropbox.com/sh/0nemsahltwwstjp/AADb9f6b99K4z2XUPwsJf96Qa?e=1&dl=0)\n\n| Field | Description |\n|---|---|\n|Protein intensity| Average proteomics data for the entire set of 8,498 and 6692 quantified| \n\n Source: [ProCan-DepMapSanger_protein_matrix_8498_averaged.txt](https://www.dropbox.com/sh/0nemsahltwwstjp/AADb9f6b99K4z2XUPwsJf96Qa?e=1&dl=0) [ProCan-DepMapSanger_protein_matrix_6692_averaged.txt](https://www.dropbox.com/sh/0nemsahltwwstjp/AADb9f6b99K4z2XUPwsJf96Qa?e=1&dl=0)"], ["BioGRID", 2, ["Protein"], ["Protein-Protein Association"], 1, "# Introduction \n [BioGRID](https://thebiogrid.org/) is a database of protein, genetic and chemical interactions that allows us to find connections between proteins.\n # Structure of data \n | Field | Description |\n| --- | --- |\n| BioGRID_Interaction_ID | A unique identifier for each interaction in the BioGRID database. |\n| Entrez_Gene_Interactor_A/B | The identifier from the Entrez-Gene database corresponding to Interactor A/B. |\n| BioGRID_ID_Interactor_A/B | The identifier in the BioGRID database corresponding to Interactor A/B. |\n| Systematic_Name_Interactor_A/B | A systematic plaintext name if known for Interactor A. |\n| Official_Symbol_Interactor_A/B | A common gene name/official symbol for Interactor A. |\n| Synonyms_Interactor_A/B | List of alternative identifiers for Interactor A/B. |\n| Experimental_System | One of the many codes supported by BioGRID for experimental evidence. |\n| Experimental_System_Type | This is either \"physical\" or \"genetic\" as a classification of the experimental system name. |\n| Author | Surname of the first author of the publication in which the interaction was demonstrated, possibly followed by additional indicators. |\n| Publication_Source | The publication source in which the interaction was shown. |\n| Organism_ID_Interactor_A/B | This is the NCBI Taxonomy ID for Interactor A. |\n| Throughput | This is either high throughput, low throughput, or both. |\n| Score | This is a positive or negative value recorded in the original publication indicating P-values, confidence scores, SGA scores, etc. |\n| Modification | In biochemical activity experiments, this field is filled with the associated post-translational modification. |\n| Qualifications | If additional plaintext information has been recorded for an interaction, these are listed. |\n| Tags | If an interaction has been classified with additional classifications, these are indicated. |\n| Source_Database | This field contains the name of the database where this interaction was provided. |\n| SWISS_PROT_Accessions_Interactor_A/B | This field contains one or more matching Swiss-Prot accessions. |\n| TREMBL_Accessions_Interactor_A/B | This field contains one or more matching Swiss-Prot accessions. |\n| REFSEQ_Accessions_Interactor_A/B | This field contains one or more matching RefSeq accessions. |\n| Ontology_Term_IDs | If ontology terms are recorded for this interaction, the official ontology term IDs for each assignment are indicated here. |\n| Ontology_Term_Names | If ontology terms are recorded for this interaction, the official ontology term name associated with the ontology term ID for each mapping is indicated here. |\n| Ontology_Term_Categories | If ontology terms are recorded for this interaction, the official ontology term category for each assignment is indicated here. |\n| Ontology_Term_Qualifier_IDs | If additional qualifying terms are linked to the terms indicated, the IDs of these qualifying terms are indicated here. |\n| Ontology_Term_Qualifier_Names | If additional qualifying terms are linked to the indicated terms, the names of these qualifying terms are indicated here. |\n| Ontology_Term_Types | In some cases, terms classified as phenotypes may contain an additional type. |\n| Organism_Name_Interactor_A/B | This is the official organism name for the organism ID. |\n\n<small>Source: [BIOGRID-ALL-4.4.227.tab3.zip](https://downloads.thebiogrid.org/File/BioGRID/Release-Archive/BIOGRID-4.4.227/BIOGRID-ALL-4.4.227.tab3.zip)</small>"], ["DrugBank", 3, ["Drug"], [], 1, "# Introduction \n DrugBank is a database with comprehensive molecular information on drugs, their mechanisms, their interactions and their targets.\n\n The complete database is licensed under CC BY-NC 4.0. With regard to the structure, we only specify the data types used.\n # Structure of data \n | Field | Description |\n| --- | --- |\n| DrugBank ID | Identifier for the DrugBank |\n| ChEMBL ID | A unique ID that has been assigned to compounds, targets, assays, documents, tissues and cell types in ChEMBL |\n| name | Name of the drug |\n| synonyms | Synonyms of the drug |\n| atc-code | Anatomical Therapeutic Chemical code: a unique code assigned to a medicine according to the organ or system it works on and how it works |\n| SMILES | Simplified molecular-input line-entry system |\n\n<small>Source: [full_database.csv](https://go.drugbank.com/releases/latest)</small>"], ["ChEMBL", 4, ["Drug"], [], 1, "# Introduction \nChEMBL is a manually curated database of bioactive molecules with drug-like properties.\n # Structure of data \n | Field | Description |\n| --- | --- |\n| molecule_chembl_id | A unique ID that has been assigned to compounds, targets, assays, documents, tissues and cell types in ChEMBL |\n| atc_classifications | Anatomical Therapeutic Chemical code: a unique code assigned to a medicine according to the organ or system it works on and how it works |\n| canonical_smiles | Simplified molecular-input line-entry system |\n|max phase_for_ind| Highest phase of clinical development that a drug candidate has reached specifically for that indication |\n| efo_term | Name of the associated drug indication |\n| molecule_type | Specific chemical structure or composition of the active ingredient in the drug |\n\n<small>Source: [chembl-webresource-client](https://pypi.org/project/chembl-webresource-client/)</small>"]]